In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import statsmodels.api as sm
import sklearn as skl
import seaborn as sns

sns.set()

In [5]:
concord = pd.read_csv('Concord.csv')
(concord.head())

,case,water81,water80,water79,income,educat,retire,peop81,cpeop,peop80
0,5,2300,3500,3500.0,35,18,0,3,0,3
1,6,2500,4600,4100.0,60,20,0,5,0,5
2,7,4000,3800,5500.0,30,16,0,6,1,5
3,8,500,1500,1700.0,20,11,1,1,-1,2
4,9,4400,4300,3700.0,50,20,0,2,0,2

In [15]:
y =  concord['water81']
x =  concord.iloc[:,2:9].drop('water79', axis=1)

print(y,y.shape)
print(x)

0      2300
1      2500
2      4000
3       500
4      4400
       ...
491    2800
492    3600
493    1100
494    2800
495    2400
Name: water81, Length: 496, dtype: int64 (496,)
     water80  income  educat  retire  peop81  cpeop
0       3500      35      18       0       3      0
1       4600      60      20       0       5      0
2       3800      30      16       0       6      1
3       1500      20      11       1       1     -1
4       4300      50      20       0       2      0
..       ...     ...     ...     ...     ...    ...
491     4400      20      16       0       2      0
492     3600      23      12       0       4      0
493     4700      45      16       0       2      0
494     1900      25      16       0       2      0
495     4300      53      14       0       4      0

[496 rows x 6 columns]